AhmedAtia1507/Spectrophotometer_GP/STM32_FINAL_CHECKPOINT/Final_3/Src/APP/SCommands/SCommands_Program.c
	/*******************************************Send Voltages***********************************************/
	HESP32_SendVoltages(glbl_uint8VoltageBuffer);
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_SendCurrentMotorsSteps   (void)
{
	SpectroStatus_SetNewStatus(BUSY);
	uint32 Loc_uint32MotorsCurrentSteps[3] = {0};
	uint32 Loc_uint32CurrentWL = 0;
	uint8 Loc_uint8Index = 0;

	for(Loc_uint8Index = HMOTOR_LAMP_SELECT; Loc_uint8Index < (HMOTOR_WL_SELECT + 1); Loc_uint8Index++)
	{
		HMOTOR_GetCurrentMotorSteps(Loc_uint8Index, &Loc_uint32MotorsCurrentSteps[Loc_uint8Index]);
	}
	HMOTOR_GetCurrentWL(&Loc_uint32CurrentWL);
	HESP32_SendMotorStatus(Loc_uint32MotorsCurrentSteps, &Loc_uint32CurrentWL, 3);
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_HomeLampMotor    (void)
{
	SpectroStatus_SetNewStatus(BUSY);
	uint32 Loc_uint32LampCurrentSteps = 0;
	uint32 Loc_uint32CurrentWL = 0;
	HMOTOR_GoHome(HMOTOR_LAMP_SELECT);
	HMOTOR_GetCurrentMotorSteps(HMOTOR_LAMP_SELECT, &Loc_uint32LampCurrentSteps);
	HMOTOR_GetCurrentWL(&Loc_uint32CurrentWL);
	HESP32_SendMotorStatus(&Loc_uint32LampCurrentSteps, &Loc_uint32CurrentWL, 1);
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_HomeWLSelectMotor (void)
{
	SpectroStatus_SetNewStatus(BUSY);
	uint32 Loc_uint32WLCurrentSteps = 0;
	uint32 Loc_uint32CurrentWL = 0;
	HMOTOR_GoHome(HMOTOR_WL_SELECT);
	HMOTOR_GetCurrentMotorSteps(HMOTOR_WL_SELECT, &Loc_uint32WLCurrentSteps);
	HMOTOR_GetCurrentWL(&Loc_uint32CurrentWL);
	HESP32_SendMotorStatus(&Loc_uint32WLCurrentSteps, &Loc_uint32CurrentWL, 1);
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_HomeFilterSelectMotor  (void)
{
	SpectroStatus_SetNewStatus(BUSY);
	uint32 Loc_uint32FilterCurrentSteps = 0;
	uint32 Loc_uint32CurrentWL = 0;
	HMOTOR_GoHome(HMOTOR_FILTER_SELECT);
	HMOTOR_GetCurrentMotorSteps(HMOTOR_FILTER_SELECT, &Loc_uint32FilterCurrentSteps);
	HMOTOR_GetCurrentWL(&Loc_uint32CurrentWL);
	HESP32_SendMotorStatus(&Loc_uint32FilterCurrentSteps, &Loc_uint32CurrentWL, 1);
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_SendCurrentWL    (void)
{
	SpectroStatus_SetNewStatus(BUSY);
	uint8 P_uint8WL[20] = {0};
	uint32 Loc_uint32CurrentWL = 0;
	HMOTOR_GetCurrentWL(&Loc_uint32CurrentWL);
	//snprintf(P_uint8WL, sizeof(P_uint8WL), "%d", Loc_uint32CurrentWL);
	float_to_string_manual(P_uint8WL, Loc_uint32CurrentWL, 0);
	HESP32_SendCommand(P_uint8WL);
	SpectroStatus_SetNewStatus(IDLE);
}

void SCommands_GetLampMotorPosition(void)
{
	SpectroStatus_SetNewStatus(BUSY);

	uint32 Loc_uint32LampSteps = 0;
	HMOTOR_GetCurrentMotorSteps(HMOTOR_LAMP_SELECT, &Loc_uint32LampSteps);

	if(Loc_uint32LampSteps == 0)
	{
		HESP32_SendCommand("UV Lamp");
	}
	else if(Loc_uint32LampSteps == 100)
	{
		HESP32_SendCommand("VI Lamp");
	}
	else
	{
		/*Do nothing*/
	}
}

void SCommands_SetLampMotorVisible(void)
{
	Std_ReturnType Loc_uint8FuncStatus = HMOTOR_MoveLampMotor(HMOTOR_LAMP_VIS);
	if(Loc_uint8FuncStatus == E_OK)
	{
		HESP32_SendCommand("moved");
	}
	else
	{
		HESP32_SendCommand("failed to move");
	}
}

void SCommands_SetLampMotorUV(void)
{
	Std_ReturnType Loc_uint8FuncStatus = HMOTOR_MoveLampMotor(HMOTOR_LAMP_UV);
	if(Loc_uint8FuncStatus == E_OK)
	{
		HESP32_SendCommand("moved");
	}
	else
	{
		HESP32_SendCommand("failed to move");
	}
}

void SCommands_SendCurrentDateTime(void)
{
	SpectroStatus_SetNewStatus(BUSY);
	Sdate_t current_date;
	Stime_t current_time;

	MRTC_GetDateAndTime(&current_date, &current_time);

	HESP32_SendDateTime(&current_date, &current_time);
	SpectroStatus_SetNewStatus(IDLE);
}

void SCommands_SendCurrentDetectorValues(void)
{
	SpectroStatus_SetNewStatus(BUSY);
	float32 Loc_float32Readings[4] = {0.0f};
	float32 Loc_float32SampleReading = 0.0f;
	float32 Loc_float32ReferenceReading = 0.0f;
	float32 Loc_float32Gain[2] = {0.0f};

	read_reference_voltage(&Loc_float32ReferenceReading, &Loc_float32Gain[0]);

	if((Loc_float32Gain[0] > 0.98f) && (Loc_float32Gain[0] < 1.01f))
	{
		Loc_float32Readings[0] = Loc_float32ReferenceReading;
		Loc_float32Readings[1] = Loc_float32ReferenceReading;
	}
	else if(Loc_float32Gain[0] > 1.01f)
	{
		Loc_float32Readings[0] = Loc_float32ReferenceReading / Loc_float32Gain[0];
		Loc_float32Readings[1] = Loc_float32ReferenceReading;
	}
	else
	{
		/*Do nothing*/
	}

	read_sample_voltage(&Loc_float32SampleReading, &Loc_float32Gain[1]);

	if((Loc_float32Gain[1] > 0.98f) && (Loc_float32Gain[1] < 1.01f))
	{
		Loc_float32Readings[2] = Loc_float32SampleReading;
		Loc_float32Readings[3] = Loc_float32SampleReading;
	}
	else if(Loc_float32Gain[1] > 1.01f)
	{
		Loc_float32Readings[2] = Loc_float32SampleReading / Loc_float32Gain[1];
		Loc_float32Readings[3] = Loc_float32SampleReading;
	}
	else
	{
		/*Do nothing*/
	}


	HESP32_SendAllDetectorValues(Loc_float32Readings, Loc_float32Gain);
	SpectroStatus_SetNewStatus(IDLE);
}

void SCommands_UpdateDateTime(uint8* P_uint8DateTime)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8DateTime != NULL_PTR)
	{
		Sdate_t date;
		Stime_t time;

		uint8* Loc_PToken = NULL_PTR;
		uint8 Loc_uint8Count = 0;
		Std_ReturnType Loc_uint8FuncStatus = E_NOT_OK;

		Loc_PToken = strtok(P_uint8DateTime, "/");

		if(Loc_PToken != NULL_PTR)
		{
			date.m_months = atoi(Loc_PToken);

			while(Loc_PToken != NULL_PTR)
			{
				Loc_uint8Count++;

				if(Loc_uint8Count < 3)
				{
					Loc_PToken = strtok(NULL_PTR, "/");

					if(Loc_PToken != NULL_PTR)
					{
						switch(Loc_uint8Count)
						{
						case 1:
						{
							date.m_days = atoi(Loc_PToken);
							break;
						}
						case 2:
						{
							Loc_PToken = strtok(Loc_PToken, " ");
							break;
						}
						}
					}
				}
				else if(Loc_uint8Count == 3)
				{
					date.m_years = atoi(Loc_PToken);
					Loc_PToken = strtok(NULL_PTR, ":");
					if(Loc_PToken != NULL_PTR)
					{
						time.m_hours = atoi(Loc_PToken);
					}
				}
				else
				{
					Loc_PToken = strtok(NULL_PTR, ":");
					if(Loc_PToken != NULL_PTR)
					{
						switch(Loc_uint8Count)
						{
						case 4:
						{
							time.m_minutes = atoi(Loc_PToken);
							break;
						}
						case 5:
						{
							time.m_seconds = atoi(Loc_PToken);
							break;
						}
						}
					}
				}
			}
		}

		if(Loc_uint8Count == 6)
		{
			Loc_uint8FuncStatus = MRTC_SetDateAndTime(&date, &time);
			if(Loc_uint8FuncStatus == E_OK)
			{
				HESP32_SendCommand("time update success");
			}
			else
			{
				HESP32_SendCommand("time update failed");
			}
		}
		else
		{
			HESP32_SendCommand("time update failed");
		}
	}
	else
	{
		HESP32_SendCommand("time update failed");
	}
	SpectroStatus_SetNewStatus(IDLE);
}


