AhmedAtia1507/Spectrophotometer_GP/STM32_FINAL_CHECKPOINT/Final_3/Src/APP/SCommands/SCommands_Program.c
		if(Loc_uint8Index == 3)
		{
			float32 temp = 0.0;

			if(Loc_float32ScanParameters[0] > Loc_float32ScanParameters[1])
			{
				temp = Loc_float32ScanParameters[0];
				Loc_float32ScanParameters[0] = Loc_float32ScanParameters[1];
				Loc_float32ScanParameters[1] = temp;
			}

			HMOTOR_MoveWLSelectMotor(Loc_float32ScanParameters[1]);
			uint32 steps = 0;
			HMOTOR_GetCurrentMotorSteps(HMOTOR_WL_SELECT, &steps);
			MUART_TxString(UART3, "WL Current Steps = ");
			MUART_SendIntegerValue(UART3, steps);
			MUART_TxChar(UART3, '\n');

			HPWRSupply_SetSupplyMode(HPWRSUPPLY_UV_SUPPLY, HPWRSUPPLY_ON);
			HPWRSupply_SetSupplyMode(HPWRSUPPLY_VIS_SUPPLY, HPWRSUPPLY_ON);

			if(Loc_float32ScanParameters[1] >= 326)
			{
				HMOTOR_MoveLampMotor(HMOTOR_LAMP_VIS);
			}
			else
			{
				HMOTOR_MoveLampMotor(HMOTOR_LAMP_UV);
			}

			read_reference_voltage(&Loc_float32RefIntensity, &gain_ref);
			read_sample_voltage(&Loc_float32SampleIntensity, &gain_sample);

			HESP32_SendIntensities(Loc_float32RefIntensity, Loc_float32SampleIntensity);

			glbl_uint32NoOfRead = roundf((Loc_float32ScanParameters[1] - Loc_float32ScanParameters[0])\
					/ Loc_float32ScanParameters[2]);
			//glbl_uint32NoOfRead--;


			HMOTOR_GetStepsPerNm(&de7k);
			glbl_float32StepsPerReading = Loc_float32ScanParameters[2] * de7k;
			MGPTMR_SetTimerUpdateCallbackFunc(MGPTMR2, SCommands_ScanOperation);
			MGPTMR_SetTimerPeriod(MGPTMR2, 20);
			MGPTMR_StartTimer(MGPTMR2);
			//			float32 Loc_float32Index = Loc_float32ScanParameters[0];

			//
			//			Sdate_t Loc_SCurrentDate = {0};
			//			Stime_t Loc_SCurrentTime = {0};
			//
			//			while(Loc_float32Index < Loc_float32ScanParameters[1])
			//			{
			//				HMOTOR_MoveMotors(Loc_float32Index);
			//				read_reference_voltage(&Loc_float32RefIntensity, &gain_ref);
			//				read_sample_voltage(&Loc_float32SampleIntensity, &gain_sample);
			//				MRTC_GetDateAndTime(&Loc_SCurrentDate, &Loc_SCurrentTime);
			//				HESP32_SendIntensities(Loc_float32Index, Loc_float32RefIntensity, Loc_float32SampleIntensity, &Loc_SCurrentDate, &Loc_SCurrentTime);
			//				MSTK_uint8Delay(1000);
			//				Loc_float32Index += Loc_float32ScanParameters[2];
			//			}
			//			//HESP32_SendCommand("done");
		}
		else
		{
			/*Do nothing*/
		}
	}
	else
	{
		/*Do nothing*/
	}
	SpectroStatus_SetNewStatus(IDLE);
}

void SCommands_SetReferenceGain(uint8* P_uint8GainToBeSet)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8GainToBeSet != NULL_PTR)
	{
		float32 Loc_uint32GainToBeSet = (float32)(atof(P_uint8GainToBeSet));
		Set_Reference_Gain(Loc_uint32GainToBeSet);
		HESP32_SendCommand("applied");
	}
	else
	{
		HESP32_SendCommand("not applied");
	}
	SpectroStatus_SetNewStatus(IDLE);
}
void SCommands_SetSampleGain(uint8* P_uint8GainToBeSet)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8GainToBeSet != NULL_PTR)
	{
		float32 Loc_uint32GainToBeSet = (float32)(atof(P_uint8GainToBeSet));
		Set_Sample_Gain(Loc_uint32GainToBeSet);
		HESP32_SendCommand("applied");
	}
	else
	{
		HESP32_SendCommand("not applied");
	}
	SpectroStatus_SetNewStatus(IDLE);
}

void SCommands_MoveFilterRight(uint8* P_uint8FilterSteps)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8FilterSteps != NULL_PTR)
	{
		uint32 Loc_uint32FilterSteps = atoi(P_uint8FilterSteps);
		HMOTOR_Step(HMOTOR_FILTER_SELECT, Loc_uint32FilterSteps, HMOTORS_CLKWISE_DIRECTION, 4);
		HESP32_SendCommand("moved");
	}
	else
	{
		HESP32_SendCommand("failed to move");
	}
	SpectroStatus_SetNewStatus(IDLE);
}
void SCommands_MoveFilterLeft(uint8* P_uint8FilterSteps)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8FilterSteps != NULL_PTR)
	{
		uint32 Loc_uint32FilterSteps = atoi(P_uint8FilterSteps);
		HMOTOR_Step(HMOTOR_FILTER_SELECT, Loc_uint32FilterSteps, HMOTORS_CCLKWISE_DIRECTION, 4);
		HESP32_SendCommand("moved");
	}
	else
	{
		HESP32_SendCommand("failed to move");
	}
	SpectroStatus_SetNewStatus(IDLE);
}
void SCommands_SelectFilter(uint8* P_uint8FilterSelect)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8FilterSelect != NULL_PTR)
	{
		HMOTOR_Filter_Select_t Loc_uint8FilterSelect = (P_uint8FilterSelect[1] - '0') - 1;
		HMOTOR_MoveFilterMotor(Loc_uint8FilterSelect);
		HESP32_SendCommand("moved");
	}
	else
	{
		HESP32_SendCommand("failed to move");
	}
	SpectroStatus_SetNewStatus(IDLE);
}

void SCommands_SelectGratingWL(uint8* P_uint8WL)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8WL != NULL_PTR)
	{
		float32 Loc_float32WL = atof(P_uint8WL);
		HMOTOR_MoveWLSelectMotor(Loc_float32WL);
		HESP32_SendCommand("moved");
	}
	else
	{
		HESP32_SendCommand("failed to move");
	}
	SpectroStatus_SetNewStatus(IDLE);
}
void SCommands_MoveGratingLeft(uint8* P_uint8WLSteps)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8WLSteps != NULL_PTR)
	{
		uint32 Loc_uint32WLSteps = atoi(P_uint8WLSteps);
		HMOTOR_Step(HMOTOR_WL_SELECT, Loc_uint32WLSteps, HMOTORS_CCLKWISE_DIRECTION, 4);
		HESP32_SendCommand("moved");
	}
	else
	{
		HESP32_SendCommand("failed to move");
	}
	SpectroStatus_SetNewStatus(IDLE);
}
void SCommands_MoveGratingRight(uint8* P_uint8WLSteps)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8WLSteps != NULL_PTR)
	{
		uint32 Loc_uint32WLSteps = atoi(P_uint8WLSteps);
		HMOTOR_Step(HMOTOR_WL_SELECT, Loc_uint32WLSteps, HMOTORS_CLKWISE_DIRECTION, 4);
		HESP32_SendCommand("moved");
	}
	else
	{
		HESP32_SendCommand("failed to move");
	}
	SpectroStatus_SetNewStatus(IDLE);
}

//void SCommands_GetDcDcP12Voltage(void)
//{
//    SpectroStatus_SetNewStatus(BUSY);
//    uint16 Loc_uint16VoltageConversion = 0;
//    float32 Loc_float32VoltageValue = 0.0;
//    uint8 glbl_uint8VoltageBuffer[32] = {0};
//
//    SPWRVolt_GetVoltage(SPWRVOLT_DCDC_POS_12, &Loc_uint16VoltageConversion);
//
//    Loc_float32VoltageValue = (float32)((float32)((float32)Loc_uint16VoltageConversion / 4096) * 3.3f) * 4;
//
//    //snprintf((glbl_uint8VoltageBuffer + 1), (sizeof(glbl_uint8VoltageBuffer) - 1), "%.*f", 3,Loc_float32VoltageValue);
//    float_to_string_manual((glbl_uint8VoltageBuffer + 1),Loc_float32VoltageValue, 3);
//    glbl_uint8VoltageBuffer[0] = '+';
//
//    HESP32_SendCommand(glbl_uint8VoltageBuffer);
//    SpectroStatus_SetNewStatus(IDLE);
//}
//
//
//void SCommands_GetDcDcN12Voltage(void)
//{
//    SpectroStatus_SetNewStatus(BUSY);
//    uint16 Loc_uint16EnteredVoltageConversion = 0;
//    uint16 Loc_uint16_33VoltageConversion = 0;
//    float32 Loc_float32EnteredVoltageValue = 0.0;
//    float32 Loc_float32_33VoltageValue = 0.0;
//    float32 Loc_float32FinalVoltageValue = 0.0;
//    uint8 glbl_uint8VoltageBuffer[32] = {0};
//
//    SPWRVolt_GetVoltage(SPWRVOLT_DCDC_NEG_12, &Loc_uint16EnteredVoltageConversion);
//    SPWRVolt_GetVoltage(SPWRVOLT_SUPPLY_33, &Loc_uint16_33VoltageConversion);
//
//    Loc_float32EnteredVoltageValue = (float32)((float32)((float32)Loc_uint16EnteredVoltageConversion / 4096) * 3.3f) ;
//    Loc_float32_33VoltageValue = (float32)((float32)((float32)Loc_uint16_33VoltageConversion / 4096) * 3.3f) * 2 ;
//
//    Loc_float32FinalVoltageValue = ((Loc_float32_33VoltageValue - Loc_float32EnteredVoltageValue) * 11) - 3.3f;
//
//    //snprintf((glbl_uint8VoltageBuffer + 1), (sizeof(glbl_uint8VoltageBuffer) - 1), "%.*f", 3,Loc_float32FinalVoltageValue);
//	float_to_string_manual((glbl_uint8VoltageBuffer + 1),Loc_float32FinalVoltageValue, 3);
//    glbl_uint8VoltageBuffer[0] = '-';
//    
//    HESP32_SendCommand(glbl_uint8VoltageBuffer);
//    SpectroStatus_SetNewStatus(IDLE);
//}
//
//
//void SCommands_GetSupply5Voltage(void)
//{
//    SpectroStatus_SetNewStatus(BUSY);
//    uint16 Loc_uint16VoltageConversion = 0;
//    float32 Loc_float32VoltageValue = 0.0;
//    uint8 glbl_uint8VoltageBuffer[32] = {0};
//
//    SPWRVolt_GetVoltage(SPWRVOLT_SUPPLY_5, &Loc_uint16VoltageConversion);
//
//    Loc_float32VoltageValue = ((float32)((float32)((float32)Loc_uint16VoltageConversion / 4096) * 3.3f) + 0.16f) * 2;
//
//    //snprintf(glbl_uint8VoltageBuffer, sizeof(glbl_uint8VoltageBuffer), "%.*f", 3,Loc_float32VoltageValue);
//    float_to_string_manual((glbl_uint8VoltageBuffer),Loc_float32VoltageValue, 3);
//    HESP32_SendCommand(glbl_uint8VoltageBuffer);
//    SpectroStatus_SetNewStatus(IDLE);
//}
//
//
//void SCommands_GetSupply33Voltage(void)
//{
//    SpectroStatus_SetNewStatus(BUSY);
//    uint16 Loc_uint16VoltageConversion = 0;
//    float32 Loc_float32VoltageValue = 0.0;
//    uint8 glbl_uint8VoltageBuffer[32] = {0};
//
//    SPWRVolt_GetVoltage(SPWRVOLT_SUPPLY_33, &Loc_uint16VoltageConversion);
//
//    Loc_float32VoltageValue = (float32)((float32)((float32)Loc_uint16VoltageConversion / 4096) * 3.3f) * 2;
//
//    //snprintf(glbl_uint8VoltageBuffer, sizeof(glbl_uint8VoltageBuffer), "%.*f", 3,Loc_float32VoltageValue);
//    float_to_string_manual((glbl_uint8VoltageBuffer),Loc_float32VoltageValue, 3);
//    
//    HESP32_SendCommand(glbl_uint8VoltageBuffer);
//    SpectroStatus_SetNewStatus(IDLE);
//}
//
//void SCommands_GetSupply12Voltage(void)
//{
//    SpectroStatus_SetNewStatus(BUSY);
//    uint16 Loc_uint16VoltageConversion = 0;
//    float32 Loc_float32VoltageValue = 0.0;
//    uint8 glbl_uint8VoltageBuffer[32] = {0};
//
//    SPWRVolt_GetVoltage(SPWRVOLT_SUPPLY_12, &Loc_uint16VoltageConversion);
//
//    Loc_float32VoltageValue = (float32)((float32)((float32)Loc_uint16VoltageConversion / 4096) * 3.3f) * 4;
//
//    //snprintf(glbl_uint8VoltageBuffer, sizeof(glbl_uint8VoltageBuffer), "%.*f", 3,Loc_float32VoltageValue);
//    float_to_string_manual((glbl_uint8VoltageBuffer),Loc_float32VoltageValue, 3);
//    
//    HESP32_SendCommand(glbl_uint8VoltageBuffer);
//    SpectroStatus_SetNewStatus(IDLE);
//}
